[
  {
    "q": "Каква е целта на използването на CMOVZ?",
    "a": "Редуциране на условните преходи"
  },
  {
    "q": "Кои от изброените абревиатури са имена на шини?",
    "a": "USB, CAN, I2C"
  },
  {
    "q": "Как се случват във времето REQ и GNT?",
    "a": "Получава се REQ, след което GNT"
  },
  {
    "q": "Между T3 и T4 кой установява сигналите за данни на шината за първата част на картинката?",
    "a": "Slave"
  },
  {
    "q": "Между T3 и T4 кой установява сигналите за данни на шината за втората част на картинката?",
    "a": "Master"
  },
  {
    "q": "Защо има по една стрелка във всяка посока?",
    "a": "Всички са верни"
  },
  {
    "q": "Какво означава CRC?",
    "a": "Cyclic Redundancy Check"
  },
  {
    "q": "Коя шина има посока от уC HOST към Ethernet?",
    "a": "TXD"
  },
  {
    "q": "Коя шина има посока от Ethernet към uC Host?",
    "a": "RXD"
  },
  {
    "q": "Какво е DMA?",
    "a": "Direct Memory Access"
  },
  {
    "q": "Колко проводна е USB3 шината?",
    "a": "9"
  },
  {
    "q": "Колко проводна е USB2 шината?",
    "a": "4"
  },
  {
    "q": "Защо D+ и D- са усукани?",
    "a": "За шумоустойчивост"
  },
  {
    "q": "Какво е SOF?",
    "a": "Start of Frame"
  },
  {
    "q": "Кой фрейм е за четене?",
    "a": "Първи"
  },
  {
    "q": "Кой фрейм е за писане?",
    "a": "Трети"
  },
  {
    "q": "За какво служат резисторите?",
    "a": "За създаване на електрическо съпротивление"
  },
  {
    "q": "Какво е предназначението на predicate?",
    "a": "Да опише даден процес"
  },
  {
    "q": "Има срязана картинка и Русалчо пита кое е първо",
    "a": "Read"
  },
  {
    "q": "Има срязана картинка и Русалчо пита кое е по средата",
    "a": "Idle"
  },
  {
    "q": "Има срязана картинка и Русалчо пита кое е накрая",
    "a": "Write"
  },
  {
    "q": "С каква цел се използва CMOWZ?",
    "a": "Редуциране на условните преходи"
  },
  {
    "q": "Защо има по една стрелка във всяка посока",
    "a": "Всички са верни"
  },
  {
    "q": "Защо се налага използването на повече линии",
    "a": "Всички са верни"
  },
  {
    "q": "Кое е означенит с B слой в CI протоколния стек",
    "a": "Transaction"
  },
  {
    "q": "Кое е означенит с C слой в CI протоколния стек",
    "a": "Data Link"
  },
  {
    "q": "Кой е елементът означен с буквата B(img 29_30)",
    "a": "Main Memory"
  },
  {
    "q": "Кой е елементът означен с буквата A(img 29_30)",
    "a": "USB Controller"
  },
  {
    "q": "Кой е елемента означен с A(img 31_32_33_34_35)",
    "a": "CPU"
  },
  {
    "q": "Кой е елемента означен с B(img 31_32_33_34_35)",
    "a": "PCI Bridge"
  },
  {
    "q": "Кой е елемента означен с C(img 31_32_33_34_35)",
    "a": "Main memory"
  },
  {
    "q": "Кой установява сигналите за данни в шината",
    "a": "Master"
  },
  {
    "q": "Кой фрейм е за запис",
    "a": "Frame 3"
  },
  {
    "q": "При USB комуникацията, за какво служат резисторите представени на схемата",
    "a": "За определяне на скоростта"
  },
  {
    "q": "Според представената на фигурата времедиаграма на PCI сигналите се осъществява",
    "a": "Четене"
  },
  {
    "q": "Посочете за кой от изброените режими на адресация се отнася следният",
    "a": "Непосредствен"
  },
  {
    "q": "Как се указва стойността на операнда при регистров режим на индексация",
    "a": "С номера на регистъра"
  },
  {
    "q": "Кой от показаните схеми показва директен режим на адресация",
    "a": "A)"
  },
  {
    "q": "Кой от изброените са фази на инструкционния конвейер",
    "a": "декодиране"
  },
  {
    "q": "Как се указва ефективният адрес на операнда в паметта при непосредствен режим на адресация",
    "a": "Чрез адресното поле на операнда в кода на инструкцията"
  },
  {
    "q": "В зависимост от режима на адресация времето за една процесорна инструкция може да варира в значителна степен. При коя от изброените подредби на адресни режими времето ще се изменя от много кратко до много дълго?",
    "a": "непосредствена, директна, косвена"
  },
  {
    "q": "При кои от изброените методи за адресация в адресната част на инструкцията е записан адресният указател",
    "a": "Непосредствена адресация"
  },
  {
    "q": "Колко инструкции за GDT(Global Descriptor Table) съществуват в IA-32 архитектурата",
    "a": "Една за всички процеси"
  },
  {
    "q": "От какъв тип е следната инструкция Add,5,15,20",
    "a": "CISC"
  },
  {
    "q": "При Signed - 2's complement кодиране, какъв е резултатът от операцията 0-1",
    "a": "1111"
  },
  {
    "q": "При Signed - 2's complement кодиране, какъв е резултатът от операцията 3-5",
    "a": "1110"
  },
  {
    "q": "При събирането на floating point числа, какво действие се извършва експонентите",
    "a": "Събират се"
  },
  {
    "q": "Какъв е приоритетът на прекъсванията представени на фигурата от най висок към най нисък",
    "a": "RS232 > Disc > Printer"
  },
  {
    "q": "Кой от посочените методи не е метод за преобразуване на виртуални адреси",
    "a": "Метод на локалността(по време и пространство)"
  },
  {
    "q": "Колко е максималният брой страници с размер 4K при 32 битов адрес",
    "a": "1M"
  },
  {
    "q": "При размер на страниците 8 байта и 8 битов адрес, колко е максималният брой страници",
    "a": "32"
  },
  {
    "q": "Коя от изброените характеристики не описва таблицата на страниците?",
    "a": "Таблицата на страниците съдържа информация за активните процеси"
  },
  {
    "q": "При размер на страниците 8 байта, на кой ред в таблицата на страниците се съдържа адресът на страницата, която съдържа адрес 18 от паметта(редовете се броят от 1)",
    "a": "3"
  },
  {
    "q": "При размер на страниците 8 байта, на кой ред в таблицата на страниците се съдържа адресът на страницата, която съдържа адрес 12 от паметта(редовете се броят от 1)",
    "a": "2"
  },
  {
    "q": "Кой от трите метода на разполагане на блокове от оперативната памет се имплементира най-лесно (изберете едно)?",
    "a": "Директно съпоставяне"
  },
  {
    "q": "Отбележете невярното твърдение (изберете едно):",
    "a": "SRAM е по-евтина DRAM"
  },
  {
    "q": "Каква е корелацията капацитет и бързодействие при компютърните памети (изберете едно)?",
    "a": "Обратнопропорционална"
  },
  {
    "q": "Какъв е формата на линията при кеш-паметта с множествена асоциативност (изберете едно)?",
    "a": "таг, множество, дума"
  },
  {
    "q": "Кой вид памети са по-бързи от кеш-паметите (изберете едно)?",
    "a": "Регистрите"
  },
  {
    "q": "Методът, при който обновяване на главната памет настъпва асинхронно след премахване на дума от кеша се нарича (изберете едно)?",
    "a": "Write-back"
  },
  {
    "q": "Методът, при който обновяване на главната памет настъпва синхронно след премахване на дума от кеша се нарича (изберете едно)?",
    "a": "Write-trough"
  },
  {
    "q": "Какъв е форматът на линията при кеш-памет с пълна асоциативност?",
    "a": "таг, дума"
  },
  {
    "q": "Дадена е машина с побайтово адресируема основна памет с размер 2^16 байта и размер на блока 8 байта. Кеш-паметта е с директна организация и се състои от 32 линии. Какъв е максималният брой байтове, които могат да бъдат разположени в кеш-паметта (изберете едно)?",
    "a": "256B"
  },
  {
    "q": "LFU е алгоритъм за:",
    "a": "заместване на най-неизползваната страница в кеш-паметта"
  },
  {
    "q": "Дадена е машина с побайтово адресируема основна памет и 2-кратен множествено асоциативен кеш. Кеш-логиката интерпретира адреса от паметта както следва: 14 бита за таг, 8 бита за множество, 2 бита за адресиране на дума. Колко е максималният брой на блоковете в главната памет (изберете едно)?",
    "a": "2^22"
  },
  {
    "q": "Кеш-памет с асоциативна организация е с капацитет 64 линии, разделени на множества с по 16 линии всяко. Основната памет съдържа 4К блока с по 128 думи всяка. Посочете адресният формат, който й съответства (форматът е: tag, set, word):",
    "a": "8 2 7"
  },
  {
    "q": "Методът, при който запис на данните се извършва само в кеш-паметта, а състоянието на кеш-блока се отбелязва като обикновено в управляващото поле с признак, наречен \"update\" или \"dirty\" се нарича:",
    "a": "Обратен запис (Write back)"
  },
  {
    "q": "Какъв е форматът на линията при кеш-памет с асоциативна организация?",
    "a": "таг, дума"
  },
  {
    "q": "При кой от трите метода на разполагане блокове от операционната памет в кеша е най-малко вероятно два блока да бъдат записани на една и съща линия?",
    "a": "Пълна асоциативност"
  },
  {
    "q": "Дадена е машина с побайтово адресируема основна памет 2^24 байта и с кеш за данни с директна организация и с капацитет 64k и 32-байтови блокове. Колко бита са необходими за таг, блок и отместване?",
    "a": "8 бита за таг, 11 бита за блок, 5 бита за уникална дума"
  },
  {
    "q": "Кои от изброените подходи способстват за намаляване на латентността при зареждане на данни в кеша?",
    "a": "Спекулативно зареждане, Отложен запис на данни, Зареждане при поискване"
  },
  {
    "q": "Кое от изброените не е вярно за кеш-паметта?",
    "a": "Намира се в адресното пространство на процесора и може да се адресира с помощта на машинните инструкции"
  },
  {
    "q": "Кои от изброените алгоритми за управление на заместването на блокове при кеш-паметите се основават на оценка на вероятността за обръщение към блока в бъдеще време?",
    "a": "Нито един от посочените."
  },
  {
    "q": "Кой от посочените методи не е метод за преобразуване на виртуални адреси?",
    "a": "Метод на локалността"
  },
  {
    "q": "Колко е максималният брой страници с размер на страниците 4k при 32-битов адрес?",
    "a": "1M"
  },
  {
    "q": "Какво съдържа TLB при странична организация на паметта?",
    "a": "Моментна карта на състоянието на страниците на оперативната памет"
  },
  {
    "q": "Коя от изброените характеристики не описва таблицата на страниците?",
    "a": "Таблицата на страниците съдържа информация за активните процеси"
  },
  {
    "q": "Какво е предназначението на TLB?",
    "a": "Да минимизира загубата на бързодействие при търсене на физическото разположение на данните"
  },
  {
    "q": "Посочете за кой от изброените режими на адресация се отнася показаната фигура\n| код | операнд |",
    "a": "Непосредствена"
  },
  {
    "q": "Как се оказва стойността на операнда при регистров режим на адресация?",
    "a": "Задава се с номера на регистъра"
  },
  {
    "q": "При кой от изброените методи на адресация в адресната част на инструкцията е записан адресен указател?",
    "a": "Индиректна адресация"
  },
  {
    "q": "Къде е местоположението на операнда при регистрово косвена адресация?",
    "a": "В основната памет"
  },
  {
    "q": "Как се указва ефективния адрес на операнда в паметта при непосредствен режим на адресация?",
    "a": "Чрез адресното поле на операнда в кода на инструкцията"
  },
  {
    "q": "Колко е максималният брой страници с размер 8 при 8-битов адрес?",
    "a": "32"
  },
  {
    "q": "При размер на страниците 8 и 8-битов адрес, кой ред на таблицата съдържа адреса на страницата?",
    "a": "3"
  },
  {
    "q": "Посочете при конвейерната обработка на коя от дадените последователности от инструкции възниква хазарт от типа write-after-read:",
    "a": "ADD R3, R2, R1; R3=R2+R1  SUB R2, R3, 1; R2=R3-1  ADD R3, R2, R5; R3 = R2+R5"
  },
  {
    "q": "Знаейки, че ускорението е правопропорционално на броя фази на конвейера, защо реално полученото ускорение е по-малко в сравнение с теоретично достижимото?",
    "a": "Заради хазартите, Заради времето необходимо за запълване на конвейера"
  },
  {
    "q": "Разделянето на инструкциите на отделни фази на обработка е характерно за (изберете едно или повече):",
    "a": "конвейерната обработка, поддържането на паралелизъм на ниво инструкции"
  },
  {
    "q": "Колко машинни цикъла ще са необходими за конвейерна обработка на 1500 инструкции в 5-фазен линеен инструкционен конвейер?",
    "a": "1504"
  },
  {
    "q": "Как се преодоляват хазартите в конвейера при достъп до общи ресурси в инструкционния поток (изберете едно или повече)?",
    "a": "чрез блокиращи техники на конвейера за определено време и последователна обработка, чрез въвеждане на закъснения и модифициране главната таблица на заетост на конвейера"
  },
  {
    "q": "В инструкционния конвейер се изпълняват едновременно (изберете едно):",
    "a": "Инструкции в реални фази"
  },
  {
    "q": "Кои от изброените техники се използват при разрешаването на проблеми при конвейерното изпълнение на инструкции с преход (изберете едно или повече)?",
    "a": "Множествено предварително изпълване на инструкции"
  },
  {
    "q": "Как се преодоляват конфликтите за памет при конвейеризираното изпълнение на инструкционния поток?",
    "a": "чрез предсказване на преходите в инструкционния поток"
  },
  {
    "q": "Посочете кои от изброените фактори са причина за понижаване на потоковата скорост при конвейерната обработка (изберете едно или повече):",
    "a": "Зависимости по данни, Конфликти при достъп на общи ресурси, Анти-зависимости по данни, Преходи в информационния поток, засягащи модифицирането на програмния брояч"
  },
  {
    "q": "На какво се дължат процедурните зависимости?",
    "a": "Инструкции за безусловен преход и инструкции с осъществен условен преход в инструкционния поток на програмата"
  },
  {
    "q": "От какво се предизвикват ресурсните конфликти?",
    "a": "Едновременни заявки за едни и същи ресурси"
  },
  {
    "q": "Кои от изброените методи се използва за решаване на проблема с инструкционните хазарти (изберете едно или повече)?",
    "a": "Пренареждане на инструкции от компилатора"
  },
  {
    "q": "Суперскаларен процесор обработва два инструкционни потока (от прости и сложни инструкции). Коя от изброените фази на разработка е обща и за двата потока?",
    "a": "Извличане"
  },
  {
    "q": "Какво е предназначението на механизмите за защита на паметта?",
    "a": "Да ограничават достъпа до определени сегменти или страници"
  },
  {
    "q": "Шината PCI в процесорната архитектура се явява мост между:",
    "a": "шина EISA и периферията"
  },
  {
    "q": "Коя/кои от изброените шини не са част от системната шина?",
    "a": "Шина за логически сигнали"
  },
  {
    "q": "В режим на директен достъп до паметта, управлението на обмена се поема от:",
    "a": "Устройството за вход/изход"
  },
  {
    "q": "Колко проводна може да бъде USB платината?",
    "a": "4, 9"
  },
  {
    "q": "Коя е правилната дефиниция за термина CISC",
    "a": "Complex Instruction Set Computing"
  },
  {
    "q": "Коя е правилната дефиниция за термина RISC",
    "a": "Reduced Instruction Set Computing"
  },
  {
    "q": "В зависимост от режима на адресация времето на изпълнение на една процесорна инструкция може да варира в значителна степен. При коя от изброените подредби на адресни режими времето ще се изменя от много кратко до много дълго?",
    "a": "непосредствена, директна, косвена"
  },
  {
    "q": "Кой от изброените етапи не е част от инструкционния цикъл?",
    "a": "Пренареждане"
  },
  {
    "q": "Кои процесори от изброените процесорни фамилии се характеризират с RISC-архитектура?",
    "a": "SPARC, MIPS-R4000, ARM"
  },
  {
    "q": "Каква система инструкции имат различните фамилии мултипроцесорни архитектури?",
    "a": "Съвпадаща отчасти, Изцяло различна"
  },
  {
    "q": "Кой/кои от изброените етапи е част от инструкционния цикъл?",
    "a": "Извличане, Изпълнение, Декодиране"
  },
  {
    "q": "Кое от твърденията относно размера на страниците е невярно?",
    "a": "По-големият размер на страниците увеличава времето за входно-изходни операции (четене, запис на страници) по време на изпълнение на програмите"
  },
  {
    "q": "От кои фактори зависи производителността на компютърните системи?",
    "a": "Архитектурата и технологията"
  },
  {
    "q": "Единицата за измерване на производителността MIPS за съпоставяне на еднотипни процесорни архитектури се основава на:",
    "a": "Брой операции с операнди от главната памет"
  },
  {
    "q": "Основни производители на x86 архитектурата са:",
    "a": "IBM, Hewlett-Packard, Intel"
  },
  {
    "q": "За какво служи програмният брояч?",
    "a": "За указване на адреса на следващата инструкция за изпълнение"
  },
  {
    "q": "Коя е правилната дефиниция за термина SIMD?",
    "a": "Single Instruction, Multiple Data"
  },
  {
    "q": "Кои от изброените техники служат за увеличаване степента на паралелизъм по време на изпълнение на програмата?",
    "a": "Прогнозиране посоката на преходите, Едновременно зареждане за изпълнение на няколко инструкции и динамично планиране, Откриване и премахване на зависимости по данни при компилиране, Реорганизация на циклите (loop unrolling)"
  },
  {
    "q": "Кои от изброените характеризира архитектурната концепция EPIC?",
    "a": "Оползотворяване на явен паралелизъм на ниво инструкция, Оползотворяване на скрития в програмния код на ниво компилатор и апаратна поддръжка, Използване на широка шина за зареждане на инструкция и дълги конвейери с голяма задръжка"
  },
  {
    "q": "За коя от изброените компютърни архитектури се отнасят следните особености:\n-Дължината на инструкциите е стотици битове\n-В рамките на процесора функционират паралелно множество функционални устройства\n-Всички функционални устройства споделят огромен общ регистров файл",
    "a": "VLIW"
  },
  {
    "q": "По какво се различават CISC от RISC?",
    "a": "Всички инструкции се характеризират с опростен формат"
  },
  {
    "q": "От какво се определя времето за изпълнение на програмата в процесора:\n1)алгоритъма 2)програмния език 3)компилатора 4)системата процесорни инструкции",
    "a": "1) и 3)"
  },
  {
    "q": "От какъв тип е следната инструкция?\nADD 5,15,20",
    "a": "CISC"
  }
]
